In [5]:
import pandas as pd

In [7]:
pd.read_excel(r'C:\Users\user\Desktop\MyExcelData.xlsx')

     Name      Batch  Rollno Grade
0   Manoj  python-09      78     A
1   Suyog  python-09      58     C
2  Chitan  python-09      47     D
3    Devi  python-09      40     E

In [10]:
pd.read_csv(r'C:\Users\user\Desktop\MyCsvdata.csv')

      Name Grade Address  PhoneNumber
0  Vishesh     A   Noida    345444332
1   Aditya   A++   Delhi    887690976
2    Vivan     B   Deira    675890322
3   Kapoor     C  Mumbai    887654324

In [21]:
pd.read_csv(r'C:\Users\user\Desktop\MyNoteCsvfile.txt')

  Name\tGrade\tAddress\tPhoneNumber
0        Devi\tA\tMumbai\t908765324
1     Raja\tA++\tDelhi\t\t876543890
2       Khan\tA+++\tuk\t\t546789097
3           Dan\tB\tUS\t\t123456789